#+TITLE: BabelStream

* EPCC Grace-Hopper nodes

** Machine configuration

Up to 4 TB/s (HBM3) or 4.9 TB/s (HBM3e) per [[https://resources.nvidia.com/en-us-grace-cpu/grace-hopper-superchip][NVIDIA specs]].

** 14 GiB array

A maximum array size of ~1879048192~ (15 GB) was chosen as it is safely below the unsigned 32-bit ~int~
limit.

#+begin_export ascii
BabelStream
Version: 5.0
Implementation: CUDA
Running kernels 100 times
Precision: double
Array size: 15032.4 MB (=15.0 GB)
Total size: 45097.2 MB (=45.1 GB)
Using CUDA device NVIDIA GH200 480GB
Driver: 12020
Memory: DEFAULT
Reduction kernel config: 528 groups of (fixed) size 1024
#+end_export

|        Run | COPY [MB / s] | SCALE [MB/s] |   ADD [MB/s] | TRIAD [MB/s] |  DOT [MB/s] |
|------------+---------------+--------------+--------------+--------------+-------------|
|          1 |   3220311.249 |  3215836.075 |  3525362.526 |  3526871.182 | 3762474.493 |
|          2 |   3220172.246 |  3215807.869 |  3525911.305 |  3526899.592 | 3760689.379 |
|          3 |   3220315.733 |  3215807.525 |  3525178.995 |  3526925.796 | 3761261.486 |
|          4 |   3220304.350 |  3215829.540 |  3525372.998 |  3526519.544 | 3761276.543 |
|          5 |   3220226.397 |  3216037.659 |  3525439.141 |  3526850.772 | 3759351.537 |
|       Mean |     3220266.0 |    3215863.7 |    3525453.0 |    3526813.4 |   3761010.7 |
|     StdDev |     63.933121 |    98.061850 |    273.81570 |    166.69485 |   1132.7318 |
| StdDev [%] |  1.9853366e-3 | 3.0493161e-3 | 7.7668232e-3 | 4.7265004e-3 | 0.030117750 |
#+TBLFM: @>>>$2..@>>>$>=vmean(@2..@>>>>) :: @>>$2..@>>$>=vsdev(@2..@>>>>) :: @>$2..@>$>=100*(@-1/@-2)
